Revit 2027 API
BuiltInFailures.SketchFailures.OpenLoop Property
 Lines must be in closed loops. The highlighted lines are open on one end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenLoop { get; }
Public Shared ReadOnly Property OpenLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenLoop {
	FailureDefinitionId^ get ();
}
static member OpenLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace